/*
SQLyog 企业版 - MySQL GUI v8.14 
MySQL - 5.5.42 : Database - simple
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`simple` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `simple`;

/*Table structure for table `teacher` */

DROP TABLE IF EXISTS `teacher`;

CREATE TABLE `teacher` (
  `tid` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '信息编号',
  `xingming` varchar(255) NOT NULL COMMENT '讲师姓名',
  `fangxiang` varchar(255) DEFAULT NULL COMMENT '教学方向',
  `lvli` varchar(255) DEFAULT NULL COMMENT '个人履历',
  `zan` varchar(255) DEFAULT NULL COMMENT '点赞数',
  PRIMARY KEY (`tid`)
) ENGINE=InnoDB AUTO_INCREMENT=45 DEFAULT CHARSET=utf8;

/*Data for the table `teacher` */

insert  into `teacher`(`tid`,`xingming`,`fangxiang`,`lvli`,`zan`) values (1,'张增斌','教学相长666','张增斌资深前端开发工程师。曾在星网锐捷任开发组长，负责IT运维Portal门户的整体开发工作，通过自主设计前台开发框架，使开发效率提升270%。','13'),(2,'樗里子','电商','韩国京畿大学经营管理学学士，2011年互联网买家关注的品牌企业获得者，10年淘宝老店骨灰级资深店主，淘宝、阿里巴巴1688创业者。经营管理学科班出身，擅长市场营销。多年创业经历，积累了丰富的电商运营经验。长期专注互联网、电子商务，对电商充满持久的热情和热爱。','6'),(3,'刀客团队','网络运维','国内更专业的课程制作团队，成员包括：','61'),(4,'石民川','新媒体/电商','京助力、北京爱创等多家互联网公司营销顾问','7'),(5,'沈老师（Wayne Shen）','大数据','北京大学数学科学博士，加拿大最大银行从事大数据应用开发和高级咨询。曾主导国内顶尖研发工作，在北美IT行业拥有15年工作经验，参加金融、保险、医疗、零售等行业的众多大型项目开发和企业数据集成，作为软件架构师、高级咨询顾问、大数据方案架构师等，负责大数据应用的方案设计','10'),(6,'胡杨柳依','HTML5','前端在线人气名师、资深前端工程师，北京大学旗下互联网教育平台课工场签约讲师，具有丰富的前端项目经验，对前端技术有独到见解，授课时对问题分析条理清晰，致力于使课程通俗易懂，期待与你共同分享。','75'),(7,'陈璇','Java','腾讯“最受欢迎女老师”，千万学员最喜爱的“璇女神”，讲课幽默风趣、化繁为简，独创“趣味游戏闯关学习法”，主讲的课工场前端及Java课程多次成为最受学生欢迎和认可的爆款课程。','4302'),(8,'小鱼','网络运维','刚毕业的大学生，对Linux操作系统和网络知识有一定的了解，对各种计算机技术都有极大的兴趣，学习能力强。在课程中扮演美女学员的角色。','98'),(9,'Leon','Java,Android','软件架构师，主攻Java、Android，7年项目开发和教学经验，4年金融上市公司技术Leader，擅长大型软件架构、微服务应用架构设计。','68'),(10,'庞利军','新媒体','12年开始进入新媒体行业，曾在某科技公司负责微信、微博运营的工作，后任某航空公司新媒体，负责新媒体方面的全部业务。有非常丰富的新媒体运营经验，并有从0到1的成功经验。','2'),(11,'大超','电商','淘系6年工作经验','8'),(12,'庞园园','UI','才女一枚，集多重身份为一身，双胞胎中的妹妹，爱画画的UI设计师，《双生子日记》、《FB夫妻志》作者，苏打苏塔设计量贩铺站长，设计总监。在用户体验及交互设计、网页、移动端UI设计方面有着丰富的经验，曾带领团队完成多个互联网视频类、教育类产品的研发和设计。','1'),(13,'课工场讲师','教学多面手','他们说，我是金牌讲师','229'),(14,'金河豚','移动UI设计','才女一枚，集多重身份为一身，双胞胎中的妹妹，爱画画的UI设计师，《双生子日记》、《FB夫妻志》作者，苏打苏塔设计量贩铺站长，设计总监。在用户体验及交互设计、网页、移动端UI设计方面有着丰富的经验，曾带领团队完成多个互联网视频类、教育类产品的研发和设计。','66'),(15,'王俊鑫','网络运维','具备七年的网络运维实战经验及多年担任系统及网络方向课程讲师，掌握各种操作系统、服务器、powershell/python编程、路由交换配置与维护技能，对各种热门新技术如网络安全、渗透测试、虚拟化、云计算均有所研究。曾参与北京08年奥运会各星级酒店服务器及网络割接项目。技术精湛，授课幽默，风格创新，童叟无欺~','139'),(16,'老牛君','UI设计','资深UI设计师，从业5年以来，服务过电商、教育、金融等领域，曾受多家企业邀约，负责UI设计师企业岗前培训。讲课浅显易懂，幽默，深受各位童鞋欢迎。','47'),(17,'任娜','UI','毕业于北京化工大学，先后就职于赶集网、环球雅思、尚德机构，长期在教育机构从事设计工作，用娱乐化的方式，讲干货。','3'),(18,'小优','电子竞技,英雄联盟,王者荣耀','电信-战争学院最强王者 曾用id 五更琉璃o 登顶战争学院 1100分最强王者','19'),(19,'刘畅','前端','美丽与智慧兼备的前端行业专家，具有多年前端项目经验和知名教育机构前端授课经验，主讲Vue.js、AngularJS、React Native等主流前端框架，清爽的授课风格深受学生喜爱。','78'),(20,'路都行','性能测试','五年华为技术leader经验，以技术方案专家的角色成功运作菲利宾第二大运营商Globe的SDP项目；转行教学后连续多年负责高校教师性能测试培训；精通需求分析，用例编写，LoadRunner 应用实践等测试必备的硬知识。','22'),(21,'刘大川','UI','设计行业十余年从业经验。曾担任北京知名企业担任设计总监和艺术院校讲师，项目经验和授课经验都非常丰富。授课风格幽默风趣，简明扼要，善于从多种角度分析问题，综合应用各个软件，准确洞察同学们学习过程中的难点，让大家的学习更加轻松。','3'),(22,'蒋飞','iOS','80后技术大牛，精通IOS开发、大数据、云计算，闲暇时间全部贡献给了IT开发行业，所以至今单身，真正的技术达人。','11'),(23,'何娅玲','HTML5','资深Web前端工程师，崇尚简洁时尚风格，曾参与新东方网站和爱V猫精品幼教视频网站等项目开发。','219'),(24,'吴飞','Linux','五年运维与Linux C编程工作经验，六年教学工作经验，先后担任红帽RHCE讲师、某培训公司资深Linux高级讲师。对Linux与Unix操作系统有深刻理解，是Linux的狂热爱好者，目前的研究方向为Linux内核架构与编程，精通KVM与Docker虚拟化，熟悉Oracle原理架构与部署。','51'),(25,'胡平','前端','特邀前端技术大咖，十年软件工程师和前端工程师工作经验，八年知名教育机构前端授课经验，主讲AngularJS、PHP、Zepto，深谙在线授课技巧，善于帮助学生快速掌握前端技能。','7'),(26,'曹圣捷','小程序','多年从事IT教育编程行业，在多家IT教育机构任职，曾被聘请中国脑瘫救助基金会互联网技术部顾问和多家上市企业互联网部外部专家','11'),(27,'Celia','SEM','11年互联网从业经验，8年SEM操作经验，5年讲师经验，操作的账户涵盖教育、食品、化工等行业','0'),(28,'韩露','Java','高级JavaEE开发工程师，北京航空航天大学软件工程管理硕士专业，6年的java项目开发经验，主要从事电力、电子商务等领域的软件开发和管理。','207'),(29,'小春儿','UI/UE设计','中国传媒大学高材生，从资深UI\\UE设计师华丽转身为产品经理。擅长用户体验及交互设计、网页UI设计、移动端UI设计，曾负责大连金石滩发现王国主题公园的整体视觉设计项目。这个善于捕捉设计灵感的80后辣妈，一直秉承“设计，让生活更美好”的理念，在8年的设计生涯中，创造了非常多令人惊艳的作品。','60'),(30,'王春艳','前端,Python,ASP.NET,C#','专注于前端方向的资深填坑者,曾就职于国内知名金融公司、以及多家上市培训企业，负责大型项架构与项目管理，2014年进入火热的在线教育行业，从此以前端践行者为己任，多年累积培养前端开发工程师将近30000名，成为前端行业指路者。擅长前端技术H5、CSS3、JavaScript原生、Bootstrap、Angularjs、vue、Zepto、NodeJS与后端编程C#、ASP.NET、Python等，是一个行业少有的精通前后端的全栈工程师。','6'),(31,'林老师(Raymond Lin)','大数据','林老师(Raymond Lin)，大数据领域的实践者、作家、教练,1989年毕业于复旦大学计算机系，1994年取得新南威尔士大学硕士学位，毕业后来到加拿大从事IT专业至今，为电讯，银行，省市政府等大机构提供技术服务，解决技术难题，建造以互联网为平台，数据处理为核心的企业级应用系统，一直活跃在技术的最前沿。林先生还积极兼职教育事业十八年，以精湛的技艺，深厚的功底，丰富的知识，培养出了一批优秀的高级IT工程师，在各自的岗位上担任着重要的角色。','6'),(32,'Geek','PHP','上得了厅堂，下得了厨房，写得了代码，查得出异常，斗得过流氓...多年开发经验与授课经验，崇尚编程思想，而不是死学代码。','42'),(33,'郑多多','平面设计','酷帅乐天派，最爱设计的90后，擅长动漫设计和平面设计，曾绘制漫画《青春是一个喜新厌旧的季节》。郑老师兼备文艺小清新与炫酷吊炸天两种气质，做设计的呀，就是这么矛盾。','284'),(34,'刘权','java','我们是课工场老师，渴望和课工场一起成长~','30'),(35,'黄斌','UI\\UE设计','UI\\UE设计师，擅长：用户体验及交互设计、Web端页面设计、移动端APP设计。熟悉互联网产品的开发流程及最新流行趋势。曾就职于大型电商类互联网企业、著名设计公司。','24'),(36,'黄小洋','JavaScript','惠普产品开发负责人，与美国团队每日沟通开发项目。十余年从教经验，独立开发一套MVC框架，成功运用多个站点之上。黄老师说，敲代码就像在谈一场有结果的恋爱。','63'),(37,'刘尧','Java','我是课工场讲师刘尧，希望能够跟随课工场一起进步~~','41'),(38,'董海','Java','软件架构师，7年项目开发及架构实战经验，擅长数据爬虫、数据分析、系统架构设计。曾任上市公司teamleader，曾负责主导电信、教育、金融等行业的大型信息系统研发。','16'),(39,'孙沛林','Android','毕业于德国美因茨大学信息学专业，有多年的软件开发及互联网经验，曾在多家IT企业担任要职，对服务端、移动客户端技术有深度的研究，个人对游戏引擎及游戏算法也有深厚的热情和经验积累。','185'),(40,'粽子姐姐','办公软件','教育技术科班出身，一头奔向在线教育，喜欢新理念、新技术，渴望分享，让教育更有趣，让学习个性化','179'),(41,'罗皆','大数据','CRM客服系统：北京移动、贵州移动、甘肃移动、辽宁移动客服系统建设；','28'),(42,'王玉伟','Android','嵌入式系统设计师，资深Android高级开发工程师，精通Android移动嵌入式开发，有4年以上Android开发经验，授课巧技高。','35'),(43,'杨冰','精通思科、华为、juniper以及云计算、容器等综合解决方案','精通思科、华为、juniper以及云计算、容器等综合解决方案，拥有多年实际工程项目经验，先后在TCL、神州数码等大型集团公司从事系统集成、运维等工作。','0'),(44,'刘校锋','网络营销','从事互联网、网络营销行业6年，尤其擅长于SEM方向，是资深的SEM经理。独立维护过教育、医疗行业多个年消费千万级别的百度推广账户，网络渠道销售额超过五千万。对于百度、Google等搜索引擎账户的优化均有丰富的实战经验，对于网络营销市场嗅觉敏感，精通各种数据分析方法。','1');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
